In [1]:
import pandas as pd
import json
import configparser
import psycopg2

In [2]:
config =configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

In [3]:
KEY = config.get("ACCESS","KEY")

SECRET = config.get("ACCESS","SECRET")

DWH_CLUSTER_TYPE       = config.get("DWH","DWH_CLUSTER_TYPE")
DWH_NUM_NODES          = config.get("DWH","DWH_NUM_NODES")
DWH_NODE_TYPE          = config.get("DWH","DWH_NODE_TYPE")
DWH_CLUSTER_IDENTIFIER = config.get("DWH","DWH_CLUSTER_ID")



DWH_ENDPOINT           = config.get("CLUSTER","host")

DWH_DB                 = config.get("CLUSTER","DB_NAME")
DWH_DB_USER            = config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DWH_PORT               = config.get("CLUSTER","DB_PORT")

DWH_IAM_ROLE_NAME      = config.get("DWH", "ROLE_NAME")

In [4]:
%load_ext sql

In [5]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://charles:Charly01@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb

'Connected: charles@dwhdb'

In [6]:
%sql SELECT count(*) FROM staging_events_table where page='NextSong' LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(6820,)]

In [7]:
%sql select * from stv_wlm_service_class_config where service_class >= 100;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(100, 'Predicted Time queue policy     ', -1, -1, 'true    ', 0, -1, -1, 5, 'Default queue                                                   ', 0, 'false   ', 'false   ', 'off                 ', 'Normal              ')]

In [8]:
%sql select a.queue_start_time, a.total_exec_time, label, trim(querytxt) \
from stl_wlm_query a, stl_query b \
where a.query = b.query and a.service_class >= 100 and a.final_state = 'Completed' \
order by b.query asc limit 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(datetime.datetime(2021, 3, 1, 8, 36, 43, 666614), 89875727, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_songs_table from 's3://udacity-dend/song_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 1, 8, 38, 13, 552912), 311269, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 1, 8, 38, 13, 911770), 245529, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 1, 8, 38, 14, 458096), 908534, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_events_table from 's3://udacity-dend/log_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 1, 8, 38, 15, 376399), 279527, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 1, 8, 38, 15, 716393), 72078, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_events_table'),
 (datetime.datetime(2021, 3, 1, 8, 38, 16, 436330), 294449, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO dimUsers (userId,firstName,lastName,gender,level) SELECT DISTINCT userId, firstName, lastName, gender,level FROM staging_events_table WHERE page = 'NextSong';"),
 (datetime.datetime(2021, 3, 1, 8, 38, 17, 225802), 642619, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'INSERT INTO dimArtists (artist_id,artist_name,location,latitude,longitude) SELECT DISTINCT artist_id,artist_name,artist_location,artist_latitude,artist_longitude FROM staging_songs_table;'),
 (datetime.datetime(2021, 3, 1, 8, 38, 18, 341224), 543939, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO dimTimes (start_time,hour,day,week,month,year,weekday) SELECT DISTINCT ('1970-01-01 00:00:00 GMT'::timestamp + (ts::text)::interval) AS s ... (457 characters truncated) ... ar, EXTRACT(weekday from ('1970-01-01 00:00:00 GMT'::timestamp + (ts::text)::interval)) AS weekday FROM staging_events_table WHERE page = 'NextSong';"),
 (datetime.datetime(2021, 3, 1, 8, 38, 19, 339780), 399521, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'INSERT INTO dimSongs (song_id,title,artist_id,year,duration) SELECT DISTINCT song_id,title,artist_id,year,duration FROM staging_songs_table;'),
 (datetime.datetime(2021, 3, 1, 8, 38, 20, 315452), 596980, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "INSERT INTO songplay (start_time,userId,level,song_id, artist_id,sessionId,location,userAgent) SELECT DISTINCT '1970-01-01 00:00:00 GMT'::timestamp + ... (101 characters truncated) ... on,e.userAgent FROM staging_events_table AS e JOIN staging_songs_table AS s ON (e.artist=s.artist_name AND e.song=s.title) WHERE e.page = 'NextSong';"),
 (datetime.datetime(2021, 3, 1, 8, 39, 4, 254526), 410685, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "SELECT count(*) FROM staging_events_table where page='NextSong' LIMIT 20;"),
 (datetime.datetime(2021, 3, 1, 8, 39, 24, 170219), 7063, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'SELECT count(*) FROM staging_events_table LIMIT 20;'),
 (datetime.datetime(2021, 3, 1, 8, 39, 29, 87256), 6949, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'SELECT count(*) FROM staging_songs_table LIMIT 20;'),
 (datetime.datetime(2021, 3, 1, 8, 40, 22, 571698), 352575, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'SELECT a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id) group by artist_name,title order by number_of_users DESC LIMIT 10;'),
 (datetime.datetime(2021, 3, 1, 8, 40, 33, 110425), 265821, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'SELECT level AS user_level, a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id) group by level,artist_name,title order by number_of_users DESC LIMIT 10;'),
 (datetime.datetime(2021, 3, 1, 8, 40, 44, 570937), 158768, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'SELECT level AS user_level, location, count(DISTINCT(userId)) AS number_of_users FROM songplay group by level,location order by number_of_users DESC LIMIT 10;'),
 (datetime.datetime(2021, 3, 1, 8, 52, 25, 628383), 94698812, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', "copy staging_songs_table from 's3://udacity-dend/song_data' credentials '' json 'auto ignorecase' region 'us-west-2';"),
 (datetime.datetime(2021, 3, 1, 8, 54, 0, 338152), 4770677, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table'),
 (datetime.datetime(2021, 3, 1, 8, 54, 5, 159251), 107290, 'default                                                                                                                                               ... (22 characters truncated) ...                                                                                                                                                      ', 'padb_fetch_sample: select * from staging_songs_table')]

In [9]:
%sql select query, service_class as svclass, service_class_start_time as starttime, query_priority \
from stl_wlm_query order by 3 asc limit 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(3, 1, datetime.datetime(2021, 3, 1, 8, 35, 59, 743241), 'Normal              '),
 (4, 100, datetime.datetime(2021, 3, 1, 8, 36, 43, 666548), 'Normal              '),
 (5, 100, datetime.datetime(2021, 3, 1, 8, 38, 13, 552881), 'Normal              '),
 (6, 100, datetime.datetime(2021, 3, 1, 8, 38, 13, 911729), 'Normal              '),
 (7, 100, datetime.datetime(2021, 3, 1, 8, 38, 14, 458064), 'Normal              '),
 (8, 100, datetime.datetime(2021, 3, 1, 8, 38, 15, 376364), 'Normal              '),
 (9, 100, datetime.datetime(2021, 3, 1, 8, 38, 15, 716351), 'Normal              '),
 (11, 100, datetime.datetime(2021, 3, 1, 8, 38, 16, 436278), 'Normal              '),
 (13, 2, datetime.datetime(2021, 3, 1, 8, 38, 16, 942325), 'Normal              '),
 (15, 100, datetime.datetime(2021, 3, 1, 8, 38, 17, 225740), 'Normal              '),
 (17, 100, datetime.datetime(2021, 3, 1, 8, 38, 18, 341158), 'Normal              '),
 (19, 2, datetime.datetime(2021, 3, 1, 8, 38, 18, 363378), 'Normal              '),
 (21, 2, datetime.datetime(2021, 3, 1, 8, 38, 19, 48429), 'Normal              '),
 (23, 100, datetime.datetime(2021, 3, 1, 8, 38, 19, 339720), 'Normal              '),
 (25, 2, datetime.datetime(2021, 3, 1, 8, 38, 19, 632464), 'Normal              '),
 (27, 2, datetime.datetime(2021, 3, 1, 8, 38, 19, 800244), 'Normal              '),
 (29, 100, datetime.datetime(2021, 3, 1, 8, 38, 20, 315404), 'Normal              '),
 (31, 1, datetime.datetime(2021, 3, 1, 8, 38, 50, 13597), 'Normal              '),
 (33, 1, datetime.datetime(2021, 3, 1, 8, 38, 50, 186796), 'Normal              '),
 (35, 1, datetime.datetime(2021, 3, 1, 8, 38, 50, 329727), 'Normal              ')]

In [10]:
%sql SELECT count(*) FROM staging_events_table where page='NextSong' LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(6820,)]

In [11]:
%sql SELECT count(*) FROM staging_events_table LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(8056,)]

In [9]:
%sql SELECT count(*) FROM staging_songs_table LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(14896,)]

In [10]:
%sql SELECT DISTINCT userId,firstName,lastName,song FROM staging_events_table \
                    WHERE page = 'NextSong' order by userId ASC LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(2, 'Jizelle', 'Benjamin', 'Self Control (Laurent Wolf & Anton Wick)'),
 (2, 'Jizelle', 'Benjamin', 'Love Stinks'),
 (2, 'Jizelle', 'Benjamin', 'Macarena'),
 (2, 'Jizelle', 'Benjamin', "Tell Me When The Party's Over/Prequiem"),
 (2, 'Jizelle', 'Benjamin', 'Pienso En Ti'),
 (2, 'Jizelle', 'Benjamin', 'Spark My Soul (feat. Substantial)'),
 (2, 'Jizelle', 'Benjamin', 'Runaway (Album Version)'),
 (2, 'Jizelle', 'Benjamin', 'Pet Semetary'),
 (2, 'Jizelle', 'Benjamin', 'Hurt Me Soul (Explicit Album Version)'),
 (2, 'Jizelle', 'Benjamin', "The Lady Is A Tramp (From 'Babes In Arms')"),
 (3, 'Isaac', 'Valdez', 'Pop Corn'),
 (3, 'Isaac', 'Valdez', 'Strasbourg'),
 (3, 'Isaac', 'Valdez', 'Adios'),
 (4, 'Alivia', 'Terrell', "I'm Sorry"),
 (4, 'Alivia', 'Terrell', 'Read My Mind'),
 (4, 'Alivia', 'Terrell', 'Chicken Hawk'),
 (4, 'Alivia', 'Terrell', 'Something Happened On The Way To Heaven'),
 (4, 'Alivia', 'Terrell', 'Bracelets (LP Version)'),
 (5, 'Elijah', 'Davis', 'Skin Is_ My'),
 (5, 'Elijah', 'Davis', 'Anything You Say (Unreleased Version)')]

In [12]:
%sql SELECT a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a \
          ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id) \
                    group by artist_name,title order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('Dwight Yoakam', "You're The One", 22),
 ('Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 9),
 ('B.o.B', "Nothin' On You [feat. Bruno Mars] (Album Version)", 7),
 ('Ron Carter', "I CAN'T GET STARTED", 6),
 ('Kid Cudi / Kanye West / Common', 'Make Her Say', 5),
 ('Kid Cudi / Kanye West / Common', 'Up Up & Away', 5),
 ('Usher featuring Jermaine Dupri', "Hey Daddy (Daddy's Home)", 4),
 ('matchbox twenty', 'Unwell (Album Version)', 4),
 ('Muse', 'Supermassive Black Hole (Album Version)', 4),
 ('Counting Crows', 'Mr. Jones', 4)]

In [15]:
%sql SELECT level AS user_level, a.artist_name, g.title, count(DISTINCT(s.userId)) AS number_of_users FROM songplay AS s JOIN dimArtists AS a \
          ON (a.artist_id = s.artist_id) JOIN dimSongs AS g ON (g.song_id= s.song_id)\
                    group by level,artist_name,title order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('paid', 'Dwight Yoakam', "You're The One", 16),
 ('free', 'Dwight Yoakam', "You're The One", 7),
 ('paid', 'B.o.B', "Nothin' On You [feat. Bruno Mars] (Album Version)", 7),
 ('paid', 'Ron Carter', "I CAN'T GET STARTED", 6),
 ('paid', 'Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 5),
 ('paid', 'matchbox twenty', 'Unwell (Album Version)', 4),
 ('paid', 'Counting Crows', 'Mr. Jones', 4),
 ('paid', 'Muse', 'Supermassive Black Hole (Album Version)', 4),
 ('free', 'Lonnie Gordon', 'Catch You Baby (Steve Pitron & Max Sanna Radio Edit)', 4),
 ('paid', 'Kid Cudi / Kanye West / Common', 'Make Her Say', 4)]

In [16]:
%sql SELECT level AS user_level, location, count(DISTINCT(userId)) AS number_of_users FROM songplay \
        group by level,location order by number_of_users DESC LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[('free', 'New York-Newark-Jersey City, NY-NJ-PA', 3),
 ('free', 'Houston-The Woodlands-Sugar Land, TX', 3),
 ('free', 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', 2),
 ('free', 'Columbia, SC', 2),
 ('paid', 'Atlanta-Sandy Springs-Roswell, GA', 2),
 ('free', 'Lubbock, TX', 1),
 ('free', 'Birmingham-Hoover, AL', 1),
 ('free', 'Washington-Arlington-Alexandria, DC-VA-MD-WV', 1),
 ('free', 'Nashville-Davidson--Murfreesboro--Franklin, TN', 1),
 ('paid', 'Waterloo-Cedar Falls, IA', 1)]

In [16]:
%sql SELECT userId FROM songplay WHERE userId = 3 LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
0 rows affected.

[]

In [53]:
%sql SELECT DISTINCT userId,firstName,lastName FROM dimUsers LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[(2, 'Jizelle', 'Benjamin'),
 (3, 'Isaac', 'Valdez'),
 (4, 'Alivia', 'Terrell'),
 (5, 'Elijah', 'Davis'),
 (6, 'Cecilia', 'Owens'),
 (7, 'Adelyn', 'Jordan'),
 (8, 'Kaylee', 'Summers'),
 (9, 'Wyatt', 'Scott'),
 (10, 'Sylvie', 'Cruz'),
 (11, 'Christian', 'Porter'),
 (12, 'Austin', 'Rosales'),
 (13, 'Ava', 'Robinson'),
 (14, 'Theodore', 'Harris'),
 (15, 'Lily', 'Koch'),
 (16, 'Rylan', 'George'),
 (17, 'Makinley', 'Jones'),
 (18, 'Jacob', 'Rogers'),
 (19, 'Zachary', 'Thomas'),
 (20, 'Aiden', 'Ramirez'),
 (22, 'Sean', 'Wilson')]

In [9]:
%sql SELECT count(*) FROM dimSongs LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(59584,)]

In [10]:
%sql SELECT count(*) FROM dimArtists LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(40100,)]

In [11]:
%sql SELECT count(*) FROM dimTimes LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(27252,)]

Example queries

Number of free users and paid users

In [25]:
%sql SELECT level, COUNT (level) FROM songplay GROUP BY level ;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
2 rows affected.

[('free', 124), ('paid', 542)]

What hour has the highest traffic

In [14]:
%sql SELECT dimTimes.hour, COUNT (dimTimes.hour) AS hour_count FROM (songplay JOIN dimTimes ON \
                                    songplay.start_time=dimTimes.start_time)\
            GROUP BY dimTimes.hour  ORDER BY hour_count DESC;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
24 rows affected.

[(1, 22),
 (5, 21),
 (20, 19),
 (3, 18),
 (9, 18),
 (10, 16),
 (17, 16),
 (14, 15),
 (12, 15),
 (15, 15),
 (2, 15),
 (18, 14),
 (23, 14),
 (8, 13),
 (21, 13),
 (11, 12),
 (13, 12),
 (16, 12),
 (22, 11),
 (4, 10),
 (6, 10),
 (19, 8),
 (0, 8),
 (7, 7)]

How many different songs were played by each user?

In [28]:
%sql SELECT songplay.userId, songplay.level, COUNT (DISTINCT(songplay.song_id)) AS user_count FROM \
                    (songplay JOIN dimUsers ON  songplay.userId=dimUsers.userId) \
                    GROUP BY songplay.userId, songplay.level ORDER BY user_count DESC LIMIT 15;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
15 rows affected.

[(49, 'paid', 34),
 (80, 'paid', 30),
 (97, 'paid', 27),
 (44, 'paid', 21),
 (88, 'paid', 16),
 (73, 'paid', 15),
 (15, 'paid', 13),
 (29, 'paid', 13),
 (36, 'paid', 12),
 (24, 'paid', 11),
 (25, 'paid', 9),
 (58, 'paid', 9),
 (30, 'paid', 8),
 (95, 'paid', 8),
 (85, 'paid', 7)]

How many songs were played from the most played artist?

In [27]:
%sql SELECT songplay.artist_id, dimArtists.artist_name, COUNT (songplay.song_id) AS songcount FROM (songplay JOIN dimArtists ON \
                                    songplay.artist_id=dimArtists.artist_id)\
            GROUP BY songplay.artist_id,dimArtists.artist_name  ORDER BY songcount DESC LIMIT 5;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
5 rows affected.

[('AR5E44Z1187B9A1D74', 'Dwight Yoakam', 37),
 ('ARD46C811C8A414F3F', 'Kid Cudi', 10),
 ('AR37SX11187FB3E164', 'Ron Carter', 9),
 ('AR5EYTL1187B98EDA0', 'Lonnie Gordon', 9),
 ('ARKQQZA12086C116FC', 'B.o.B', 8)]